<?php


namespace App\classes;


class News
{
    public $newsId;
    public $news = [];

    public function __construct($id = null)
    {
        $this->newsId = $id;
    }

    public function allNews()
    {
        $this->news = [
            0 => [
                'id' => 1,
                'category_id' => 1,
                'title' => 'সর্বশেষ',
                'author_name' => 'Alif Khan',
                'image' => '1.webp',
                'short_description' => 'মাইকের ব্যবসায় নেমে আসা নীরবতা',
                'long_description' => 'একটা সময় ছিল যখন বিয়ে, জন্মদিন, যাত্রাপালাসহ যেকোনো সামাজিক অনুষ্ঠানেই মাইকের ব্যবহার দেখা যেত। এসব অনুষ্ঠানের দুই–এক দিন আগে থেকেই মাইক ভাড়া নেওয়ার জন্য দোকানগুলোয় ক্রেতাদের আনাগোনা দেখা যেত। তবে সময়ের ব্যবধানে পাল্টেছে দৃশ্যপট। এখন আর অনুষ্ঠানগুলোয় মাইকের তেমন কদর নেই।',
            ],
            1 => [
                'id' => 2,
                'category_id' => 1,
                'title' => 'বিশেষ সংবাদ',
                'author_name' => 'Sadiya',
                'image' => '2.webp',
                'short_description' => 'সিলেটে সাংবাদিকের ওপর হামলার ঘটনায় ছাত্রলীগ কর্মীর নামে মামলা',
                'long_description' => 'একটা সময় ছিল যখন বিয়ে, জন্মদিন, যাত্রাপালাসহ যেকোনো সামাজিক অনুষ্ঠানেই মাইকের ব্যবহার দেখা যেত। এসব অনুষ্ঠানের দুই–এক দিন আগে থেকেই মাইক ভাড়া নেওয়ার জন্য দোকানগুলোয় ক্রেতাদের আনাগোনা দেখা যেত। তবে সময়ের ব্যবধানে পাল্টেছে দৃশ্যপট। এখন আর অনুষ্ঠানগুলোয় মাইকের তেমন কদর নেই।',
            ],
            2 => [
                'id' => 3,
                'category_id' => 2,
                'title' => 'রাজনীতি',
                'author_name' => 'CR',
                'image' => '3.webp',
                'short_description' => 'সিলেটে হাসপাতাল প্রাঙ্গণে অ্যাম্বুলেন্সচাপায় রোগীর মৃত্যুর ঘটনায় মামলা',
                'long_description' => 'একটা সময় ছিল যখন বিয়ে, জন্মদিন, যাত্রাপালাসহ যেকোনো সামাজিক অনুষ্ঠানেই মাইকের ব্যবহার দেখা যেত। এসব অনুষ্ঠানের দুই–এক দিন আগে থেকেই মাইক ভাড়া নেওয়ার জন্য দোকানগুলোয় ক্রেতাদের আনাগোনা দেখা যেত। তবে সময়ের ব্যবধানে পাল্টেছে দৃশ্যপট। এখন আর অনুষ্ঠানগুলোয় মাইকের তেমন কদর নেই।',
            ],
            3 => [
                'id' => 4,
                'category_id' => 2,
                'title' => 'বাংলাদেশ',
                'author_name' => 'Alif Khan',
                'image' => '4.webp',
                'short_description' => 'বাগেরহাটে ইটবোঝাই ট্রলির ধাক্কায় ভ্যানের দু্ই যাত্রী নিহত',
                'long_description' => 'একটা সময় ছিল যখন বিয়ে, জন্মদিন, যাত্রাপালাসহ যেকোনো সামাজিক অনুষ্ঠানেই মাইকের ব্যবহার দেখা যেত। এসব অনুষ্ঠানের দুই–এক দিন আগে থেকেই মাইক ভাড়া নেওয়ার জন্য দোকানগুলোয় ক্রেতাদের আনাগোনা দেখা যেত। তবে সময়ের ব্যবধানে পাল্টেছে দৃশ্যপট। এখন আর অনুষ্ঠানগুলোয় মাইকের তেমন কদর নেই।',
            ],
            4 => [
                'id' => 5,
                'category_id' => 3,
                'title' => 'করোনাভাইরাস',
                'author_name' => 'Sadiya',
                'image' => '5.webp',
                'short_description' => 'সিলেটে সাংবাদিকের ওপর হামলার ঘটনায় ছাত্রলীগ কর্মীর নামে মামলা',
                'long_description' => 'একটা সময় ছিল যখন বিয়ে, জন্মদিন, যাত্রাপালাসহ যেকোনো সামাজিক অনুষ্ঠানেই মাইকের ব্যবহার দেখা যেত। এসব অনুষ্ঠানের দুই–এক দিন আগে থেকেই মাইক ভাড়া নেওয়ার জন্য দোকানগুলোয় ক্রেতাদের আনাগোনা দেখা যেত। তবে সময়ের ব্যবধানে পাল্টেছে দৃশ্যপট। এখন আর অনুষ্ঠানগুলোয় মাইকের তেমন কদর নেই।',
            ],
            5 => [
                'id' => 6,
                'category_id' => 3,
                'title' => 'বিশ্ব',
                'author_name' => 'CR',
                'image' => '6.webp',
                'short_description' => 'সিলেটে হাসপাতাল প্রাঙ্গণে অ্যাম্বুলেন্সচাপায় রোগীর মৃত্যুর ঘটনায় মামলা',
                'long_description' => 'একটা সময় ছিল যখন বিয়ে, জন্মদিন, যাত্রাপালাসহ যেকোনো সামাজিক অনুষ্ঠানেই মাইকের ব্যবহার দেখা যেত। এসব অনুষ্ঠানের দুই–এক দিন আগে থেকেই মাইক ভাড়া নেওয়ার জন্য দোকানগুলোয় ক্রেতাদের আনাগোনা দেখা যেত। তবে সময়ের ব্যবধানে পাল্টেছে দৃশ্যপট। এখন আর অনুষ্ঠানগুলোয় মাইকের তেমন কদর নেই।',
            ],
            6 => [
                'id' => 7,
                'category_id' => 4,
                'title' => 'বাণিজ্য',
                'author_name' => 'Samim',
                'image' => '7.webp',
                'short_description' => 'বাগেরহাটে ইটবোঝাই ট্রলির ধাক্কায় ভ্যানের দু্ই যাত্রী নিহত',
                'long_description' => 'একটা সময় ছিল যখন বিয়ে, জন্মদিন, যাত্রাপালাসহ যেকোনো সামাজিক অনুষ্ঠানেই মাইকের ব্যবহার দেখা যেত। এসব অনুষ্ঠানের দুই–এক দিন আগে থেকেই মাইক ভাড়া নেওয়ার জন্য দোকানগুলোয় ক্রেতাদের আনাগোনা দেখা যেত। তবে সময়ের ব্যবধানে পাল্টেছে দৃশ্যপট। এখন আর অনুষ্ঠানগুলোয় মাইকের তেমন কদর নেই।',
            ],
            7 => [
                'id' => 8,
                'category_id' => 4,
                'title' => 'খেলা',
                'author_name' => 'Tonmoy',
                'image' => '8.webp',
                'short_description' => 'বাগেরহাটে ইটবোঝাই ট্রলির ধাক্কায় ভ্যানের দু্ই যাত্রী নিহত',
                'long_description' => 'একটা সময় ছিল যখন বিয়ে, জন্মদিন, যাত্রাপালাসহ যেকোনো সামাজিক অনুষ্ঠানেই মাইকের ব্যবহার দেখা যেত। এসব অনুষ্ঠানের দুই–এক দিন আগে থেকেই মাইক ভাড়া নেওয়ার জন্য দোকানগুলোয় ক্রেতাদের আনাগোনা দেখা যেত। তবে সময়ের ব্যবধানে পাল্টেছে দৃশ্যপট। এখন আর অনুষ্ঠানগুলোয় মাইকের তেমন কদর নেই।',
            ],
        ];
        return $this->news;
    }
    public function getDetails($id)
    {
        $this->news = $this->allNews();
        foreach ($this->news as $news)
        {
            if($news['id'] == $id)
            {
                return $news;
            }
        }
    }
}